ЕРПУХАстенд.cbr_Основной/src/InformationRegisters/НомераСерийПоВидам/НомераСерийПоВидам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НомераСерийПоВидам</name>
  <comment>//cbr-larkovgeorg 27.02.2026 ПРЗ.33(перенос функционала)</comment>
  <resources>
    <name>НомерСерии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипШаблона</name>
    <type>
      <types>EnumRef.ШаблоныНаименованийСерий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЕРПУХАстенд.cbr_Основной/src/Enums/ШаблоныНаименованийСерий/ШаблоныНаименованийСерий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ШаблоныНаименованийСерий</name>
  <comment>//cbr-larkovgeorg 27.02.2025 ПРЗ.33(перенос функционала Нумерация серий в ЕРП)</comment>
  <enumValues>
    <name>Трехсимвольный</name>
  </enumValues>
  <enumValues>
    <name>Четырехсимвольный</name>
  </enumValues>
  <enumValues>
    <name>Пятисимвольный</name>
  </enumValues>
  <enumValues>
    <name>Шестисимвольный</name>
  </enumValues>
  <enumValues>
    <name>Семисимвольный</name>
  </enumValues>
  <enumValues>
    <name>Восьмисимвольный</name>
  </enumValues>
  <enumValues>
    <name>Девятисимвольный</name>
  </enumValues>
  <enumValues>
    <name>Десятисимвольный</name>
  </enumValues>
</mdclass:Enum>

ЕРПУХАстенд.cbr_Основной/src/InformationRegisters/НомераСерийПоВидам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СледущийНомерСерии(ВидНоменклатуры) Экспорт
	
	РезультатФункции = "";
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипШаблона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ШаблонНаименованияСерий");
	
	Выборка = Выбрать(Новый Структура("ТипШаблона", ТипШаблона));
	
	Если Не Выборка.Следующий() Тогда
		
		Возврат СамыйПервыйНомерПоШаблону(ТипШаблона);
		
	КонецЕсли;
	
	ТекущийНомер = СокрЛП(Выборка.НомерСерии);
	Если Не ЗначениеЗаполнено(ТекущийНомер) Тогда
		
		Возврат СамыйПервыйНомерПоШаблону(ТипШаблона);
		
	КонецЕсли;
	
	ТекущееЧислоСтрокой = ТекущийНомер;	
	ТекущееЧисло = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТекущееЧислоСтрокой);
	Если ТекущееЧисло = Неопределено Или ТекущееЧисло = 0 Тогда
		// некорректное текущее число
		ТекстИсключения = НСтр("ru = 'Последнее сохраненное значение для шаблона наименований серий ""%1"" некорректно'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ТипШаблона);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	ТекущееЧисло = ТекущееЧисло + 1;
	
	Если ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Трехсимвольный Тогда
		РезультатФункции = Формат(ТекущееЧисло, "ЧЦ=3; ЧВН=; ЧГ=0");
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Четырехсимвольный Тогда
		РезультатФункции = Формат(ТекущееЧисло, "ЧЦ=4; ЧВН=; ЧГ=0");
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Пятисимвольный Тогда
		РезультатФункции = Формат(ТекущееЧисло, "ЧЦ=5; ЧВН=; ЧГ=0");
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Шестисимвольный Тогда
		РезультатФункции = Формат(ТекущееЧисло, "ЧЦ=6; ЧВН=; ЧГ=0");
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Семисимвольный Тогда
		РезультатФункции = Формат(ТекущееЧисло, "ЧЦ=7; ЧВН=; ЧГ=0");
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Восьмисимвольный Тогда
		РезультатФункции = Формат(ТекущееЧисло, "ЧЦ=8; ЧВН=; ЧГ=0");
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Девятисимвольный Тогда
		РезультатФункции = Формат(ТекущееЧисло, "ЧЦ=9; ЧВН=; ЧГ=0");
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Десятисимвольный Тогда
		РезультатФункции = Формат(ТекущееЧисло, "ЧЦ=10; ЧВН=; ЧГ=0");
	Иначе
		РезультатФункции = Формат(ТекущееЧисло, "ЧЦ=8; ЧВН=; ЧГ=0");
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ЗаписатьНовыйНомер(НовыйНомер, ВидНоменклатуры, Отказ, Серия = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипШаблона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ШаблонНаименованияСерий");
	
	Если Не СоответствуетШаблону(НовыйНомер, ТипШаблона) Тогда
		ТекстСообщения = НСтр("ru='Номер ""%1"" не соответствует шаблону для вида номенклатуры: %2. Запись отменена!'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, НовыйНомер, ВидНоменклатуры);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТипШаблона = ТипШаблона;
	
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.ТипШаблона = ТипШаблона;
	МенеджерЗаписи.НомерСерии = НовыйНомер;
	Если ЗначениеЗаполнено(Серия) Тогда
		МенеджерЗаписи.Серия = Серия;
	КонецЕсли;
	
	МенеджерЗаписи.Записать(Истина);
		
КонецПроцедуры

Функция ТекущийНомерСерииЧисло(ВидНоменклатуры) Экспорт

	РезультатФункции = "";

	УстановитьПривилегированныйРежим(Истина);
	
	ТипШаблона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ШаблонНаименованияСерий");
	
	Выборка = Выбрать(Новый Структура("ТипШаблона", ТипШаблона));
	
	Если Не Выборка.Следующий() Тогда
		
		Возврат 0;
		
	КонецЕсли;
	
	ТекущийНомерСтрокой = Выборка.НомерСерии;	
	
	Возврат СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТекущийНомерСтрокой);
	
КонецФункции

Функция СоответствуетШаблону(ТекущийНомерСтрокой, ТипШаблона = Неопределено) Экспорт
	
	РезультатФункции = Истина;
	
	Шаблон = "[0-9]{8}";
	
	Если ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Трехсимвольный Тогда
		Шаблон = "[0-9]{3}";
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Четырехсимвольный Тогда
		Шаблон = "[0-9]{4}";
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Пятисимвольный Тогда
		Шаблон = "[0-9]{5}";
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Шестисимвольный Тогда
		Шаблон = "[0-9]{6}";
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Семисимвольный Тогда
		Шаблон = "[0-9]{7}";
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Восьмисимвольный Тогда
		Шаблон = "[0-9]{8}";
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Девятисимвольный Тогда
		Шаблон = "[0-9]{9}";
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Десятисимвольный Тогда
		Шаблон = "[0-9]{10}";
	КонецЕсли;
	
	РезультатФункции = СтрПодобнаПоРегулярномуВыражению(ТекущийНомерСтрокой, Шаблон);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПривестиКШаблону(НомерЧислом, ВидНоменклатуры) Экспорт
	
	РезультатФункции = "";

	ТипШаблона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ШаблонНаименованияСерий");
	
	Если ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Трехсимвольный Тогда
		РезультатФункции = Формат(НомерЧислом, "ЧЦ=3; ЧВН=; ЧГ=0");
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Четырехсимвольный Тогда
		РезультатФункции = Формат(НомерЧислом, "ЧЦ=4; ЧВН=; ЧГ=0");
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Пятисимвольный Тогда
		РезультатФункции = Формат(НомерЧислом, "ЧЦ=5; ЧВН=; ЧГ=0");
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Шестисимвольный Тогда
		РезультатФункции = Формат(НомерЧислом, "ЧЦ=6; ЧВН=; ЧГ=0");
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Семисимвольный Тогда
		РезультатФункции = Формат(НомерЧислом, "ЧЦ=7; ЧВН=; ЧГ=0");
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Восьмисимвольный Тогда
		РезультатФункции = Формат(НомерЧислом, "ЧЦ=8; ЧВН=; ЧГ=0");
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Девятисимвольный Тогда
		РезультатФункции = Формат(НомерЧислом, "ЧЦ=9; ЧВН=; ЧГ=0");
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Десятисимвольный Тогда
		РезультатФункции = Формат(НомерЧислом, "ЧЦ=10; ЧВН=; ЧГ=0");
	Иначе
		РезультатФункции = Формат(НомерЧислом, "ЧЦ=8; ЧВН=; ЧГ=0");
		//ТекстИсключения = НСтр("ru = 'Не определён шаблон для шаблона наименований серий у вида номенклатуры: %1'");
		//ТекстИсключения = СтрШаблон(ТекстИсключения, ВидНоменклатуры);
		//ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СамыйПервыйНомерПоШаблону(ТипШаблона)
	
	НовоеЧисло = 1;
	
	РезультатФункции = Формат(НовоеЧисло, "ЧЦ=8; ЧВН=; ЧГ=0");
	
	Если ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Трехсимвольный Тогда
		РезультатФункции = Формат(НовоеЧисло, "ЧЦ=3; ЧВН=; ЧГ=0");
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Четырехсимвольный Тогда
		РезультатФункции = Формат(НовоеЧисло, "ЧЦ=4; ЧВН=; ЧГ=0");
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Пятисимвольный Тогда
		РезультатФункции = Формат(НовоеЧисло, "ЧЦ=5; ЧВН=; ЧГ=0");
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Шестисимвольный Тогда
		РезультатФункции = Формат(НовоеЧисло, "ЧЦ=6; ЧВН=; ЧГ=0");
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Семисимвольный Тогда
		РезультатФункции = Формат(НовоеЧисло, "ЧЦ=7; ЧВН=; ЧГ=0");
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Восьмисимвольный Тогда
		РезультатФункции = Формат(НовоеЧисло, "ЧЦ=8; ЧВН=; ЧГ=0");
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Девятисимвольный Тогда
		РезультатФункции = Формат(НовоеЧисло, "ЧЦ=9; ЧВН=; ЧГ=0");
	ИначеЕсли ТипШаблона = Перечисления.ШаблоныНаименованийСерий.Десятисимвольный Тогда
		РезультатФункции = Формат(НовоеЧисло, "ЧЦ=10; ЧВН=; ЧГ=0");
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции



#КонецОбласти

#КонецЕсли
